STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213fxx_ca35.h
   RESERVED_368                     = 368,     /*!< reserved                                                            */
   RESERVED_369                     = 369,     /*!< reserved                                                            */
   RESERVED_370                     = 370,     /*!< reserved                                                            */
   RESERVED_371                     = 371,     /*!< reserved                                                            */
   RESERVED_372                     = 372,     /*!< reserved                                                            */
   RESERVED_373                     = 373,     /*!< reserved                                                            */
   RESERVED_374                     = 374,     /*!< reserved                                                            */
   RESERVED_375                     = 375,     /*!< reserved                                                            */
   RESERVED_376                     = 376,     /*!< reserved                                                            */
   RESERVED_377                     = 377,     /*!< reserved                                                            */
   RESERVED_378                     = 378,     /*!< reserved                                                            */
   RESERVED_379                     = 379,     /*!< reserved                                                            */
   RESERVED_380                     = 380,     /*!< reserved                                                            */
   RESERVED_381                     = 381,     /*!< reserved                                                            */
   RESERVED_382                     = 382,     /*!< reserved                                                            */
   RESERVED_383                     = 383,     /*!< reserved                                                            */
   RESERVED_384                     = 384,     /*!< reserved                                                            */
   RESERVED_385                     = 385,     /*!< reserved                                                            */
   RESERVED_386                     = 386,     /*!< reserved                                                            */
   RESERVED_387                     = 387,     /*!< reserved                                                            */
   RESERVED_388                     = 388,     /*!< reserved                                                            */
   RESERVED_389                     = 389,     /*!< reserved                                                            */
   RESERVED_390                     = 390,     /*!< reserved                                                            */
   RESERVED_391                     = 391,     /*!< reserved                                                            */
   RESERVED_392                     = 392,     /*!< reserved                                                            */
   RESERVED_393                     = 393,     /*!< reserved                                                            */
   RESERVED_394                     = 394,     /*!< reserved                                                            */
   RESERVED_395                     = 395,     /*!< reserved                                                            */
   RESERVED_396                     = 396,     /*!< reserved                                                            */
   RESERVED_397                     = 397,     /*!< reserved                                                            */
   RESERVED_398                     = 398,     /*!< reserved                                                            */
   RESERVED_399                     = 399,     /*!< reserved                                                            */
   PMUIRQ0_IRQn                     = 400,     /*!< Cortex-A35 Core#0 Performance Monitor Interrupt                     */
   PMUIRQ1_IRQn                     = 401,     /*!< Cortex-A35 Core#1 Performance Monitor Interrupt                     */
   RESERVED_402                     = 402,     /*!< reserved                                                            */
   RESERVED_403                     = 403,     /*!< reserved                                                            */
   COMMRX0_IRQn                     = 404,     /*!< Cortex-A35 Core#0 Debug Communication Channel Receive interrupt     */
   COMMRX1_IRQn                     = 405,     /*!< Cortex-A35 Core#1 Debug Communication Channel Receive interrupt     */
   RESERVED_406                     = 406,     /*!< reserved                                                            */
   RESERVED_407                     = 407,     /*!< reserved                                                            */
   COMMTX0_IRQn                     = 408,     /*!< Cortex-A35 Core#0 Debug Communication Channel Transmit interrupt    */
   COMMTX1_IRQn                     = 409,     /*!< Cortex-A35 Core#1 Debug Communication Channel Transmit interrupt    */
   RESERVED_410                     = 410,     /*!< reserved                                                            */
   RESERVED_411                     = 411,     /*!< reserved                                                            */
   nCTIIRQ0_IRQn                    = 412,     /*!< Cortex-A35 Core#0 CTI interrupt                                     */
   nCTIIRQ1_IRQn                    = 413,     /*!< Cortex-A35 Core#1 CTI interrupt                                     */
   RESERVED_414                     = 414,     /*!< reserved                                                            */
   RESERVED_415                     = 415,     /*!< reserved                                                            */
   MAX_IRQ_n
 } IRQn_Type;



/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

#define SDC        /*!< Step Down Converter feature */

/**
  * @brief Configuration of the Cortex-A35 Processor and Core Peripherals
  */
#define __A35_REV                0x0100U      /*!< Cortex-A35 revision r1p0                    */
#define __CORTEX_A                   7U       /*!< Cortex-A# Core - WARNINGS :                 */
                                              /*!< - set to A7 to get something from core_ca.h */
                                              /*!< - to be set to "35U" once A35 is supported  */
                                              /*!<   by CMSIS core_ca                          */
#define __CA_REV                 0x0100U      /*!< Core (A35) revision r1p0                    */
#define __FPU_PRESENT                 1U      /*!< Set to 1 if FPU is present                  */
#define __GIC_PRESENT                 1U      /*!< Set to 1 if GIC is present                  */
#define __TIM_PRESENT                 1U      /*!< Set to 1 if TIM is present                  */
#define __L2C_PRESENT                 0U      /*!< Set to 1 if L2C is present                  */

#define GIC_BASE             0x4AC00000UL
#define GIC_DISTRIBUTOR_BASE (GIC_BASE+0x10000UL)
#define GIC_INTERFACE_BASE   (GIC_BASE+0x20000UL)
/* Number of implemented interrupt lines */
/* to be computed from GICD_TYPER.ITLinesNumber, bits [4:0] = NUM_SPIS/32 */
/* 0xC = 12 --> (12+1)*32 = 416 */
#define IRQ_GIC_LINE_COUNT   (416U)
/* Number of priority bits according to A35 security state */
#if defined(A35_NON_SECURE)
#define GIC_PRIO_BITS                 4U
#else
#define GIC_PRIO_BITS                 5U
#endif /* defined(A35_NON_SECURE) */
#define GIC_PRIORITY(x)               ((x)<<(8U-GIC_PRIO_BITS))
#include "core_ca.h"

/**
  * @}
  */

#include "system_stm32mp2xx.h"
#include <stdint.h>

