STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213fxx_ca35.h
/***************  Bit definition for DDRDBG_BYPASS_PCLKEN  *****************/
#define DDRDBG_BYPASS_PCLKEN_ENABLE_Pos  (0U)
#define DDRDBG_BYPASS_PCLKEN_ENABLE_Msk  (0x1UL << DDRDBG_BYPASS_PCLKEN_ENABLE_Pos)  /*!< 0x00000001 */
#define DDRDBG_BYPASS_PCLKEN_ENABLE      DDRDBG_BYPASS_PCLKEN_ENABLE_Msk            /*!< The DDRPHYC Bypass_Pclken is active. The targeted data rate is less than 666 MT/s. The clock fed to the SDRAM interface is the one coming directly from the interfan frac pll, and the DDRPHYC does not alter it. */

/***************  Bit definition for DDRDBG_DDRC_AUTO_SR_DELAY  ************/
#define DDRDBG_DDRC_AUTO_SR_DELAY_DELAY_CYCLES_Pos  (0U)
#define DDRDBG_DDRC_AUTO_SR_DELAY_DELAY_CYCLES_Msk  (0x7FUL << DDRDBG_DDRC_AUTO_SR_DELAY_DELAY_CYCLES_Pos)  /*!< 0x0000007F */
#define DDRDBG_DDRC_AUTO_SR_DELAY_DELAY_CYCLES      DDRDBG_DDRC_AUTO_SR_DELAY_DELAY_CYCLES_Msk             /*!< Number of delay cycles to wait before to gate down the DDRC clock when in auto self-refresh. */

/***************  Bit definition for DDRDBG_OBSP_CTRL  *********************/
#define DDRDBG_OBSP_CTRL_OBSP0_SEL_Pos  (0U)
#define DDRDBG_OBSP_CTRL_OBSP0_SEL_Msk  (0x1FUL << DDRDBG_OBSP_CTRL_OBSP0_SEL_Pos)  /*!< 0x0000001F */
#define DDRDBG_OBSP_CTRL_OBSP0_SEL      DDRDBG_OBSP_CTRL_OBSP0_SEL_Msk             /*!< Selects which of the input observable signal is forwarded to the HDP on selectable observability line 0. */
#define DDRDBG_OBSP_CTRL_OBSP1_SEL_Pos  (8U)
#define DDRDBG_OBSP_CTRL_OBSP1_SEL_Msk  (0x1FUL << DDRDBG_OBSP_CTRL_OBSP1_SEL_Pos)  /*!< 0x00001F00 */
#define DDRDBG_OBSP_CTRL_OBSP1_SEL      DDRDBG_OBSP_CTRL_OBSP1_SEL_Msk             /*!< Selects which of the input observable signal is forwarded to the HDP on selectable observability line 1. */
#define DDRDBG_OBSP_CTRL_OBSP2_SEL_Pos  (16U)
#define DDRDBG_OBSP_CTRL_OBSP2_SEL_Msk  (0x1FUL << DDRDBG_OBSP_CTRL_OBSP2_SEL_Pos)  /*!< 0x001F0000 */
#define DDRDBG_OBSP_CTRL_OBSP2_SEL      DDRDBG_OBSP_CTRL_OBSP2_SEL_Msk             /*!< Selects which of the input observable signal is forwarded to the HDP on selectable observability line 2. */
#define DDRDBG_OBSP_CTRL_OBSP3_SEL_Pos  (24U)
#define DDRDBG_OBSP_CTRL_OBSP3_SEL_Msk  (0x1FUL << DDRDBG_OBSP_CTRL_OBSP3_SEL_Pos)  /*!< 0x1F000000 */
#define DDRDBG_OBSP_CTRL_OBSP3_SEL      DDRDBG_OBSP_CTRL_OBSP3_SEL_Msk             /*!< Selects which of the input observable signal is forwarded to the HDP on selectable observability line 3. */

/***************  Bit definition for DDRDBG_FRAC_PLL_LOCK  *****************/
#define DDRDBG_FRAC_PLL_LOCK_LOCK_Pos  (0U)
#define DDRDBG_FRAC_PLL_LOCK_LOCK_Msk  (0x1UL << DDRDBG_FRAC_PLL_LOCK_LOCK_Pos)  /*!< 0x00000001 */
#define DDRDBG_FRAC_PLL_LOCK_LOCK      DDRDBG_FRAC_PLL_LOCK_LOCK_Msk            /*!< PLL lock, direct copy of ddrss_pll2_lock. */

/***************  Bit definition for DDRDBG_DTO_OUTPUT  ********************/
#define DDRDBG_DTO_OUTPUT_DTO_Pos  (0U)
#define DDRDBG_DTO_OUTPUT_DTO_Msk  (0x1UL << DDRDBG_DTO_OUTPUT_DTO_Pos)  /*!< 0x00000001 */
#define DDRDBG_DTO_OUTPUT_DTO      DDRDBG_DTO_OUTPUT_DTO_Msk            /*!< DDRPHYC DTO output is stored in this register. Among other signals of interests, the DDRPHYC PLL lock can be observed on this register. */

/***************  Bit definition for DDRDBG_DFI_ERRORS_CTRL  ***************/
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_CLEAR_Pos  (0U)
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_CLEAR_Msk  (0x1UL << DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_CLEAR_Pos)  /*!< 0x00000001 */
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_CLEAR      DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_CLEAR_Msk            /*!< Clears the interrupt linked with dfi_error0. */
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_SET_Pos    (1U)
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_SET_Msk    (0x1UL << DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_SET_Pos)    /*!< 0x00000002 */
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_SET        DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR0_SET_Msk              /*!< Triggers the interrupt linked with dfi_error0. */
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_CLEAR_Pos  (8U)
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_CLEAR_Msk  (0x1UL << DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_CLEAR_Pos)  /*!< 0x00000100 */
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_CLEAR      DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_CLEAR_Msk            /*!< Clears the interrupt linked with dfi_error1. */
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_SET_Pos    (9U)
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_SET_Msk    (0x1UL << DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_SET_Pos)    /*!< 0x00000200 */
#define DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_SET        DDRDBG_DFI_ERRORS_CTRL_DFI_ERROR1_SET_Msk              /*!< Triggers the interrupt linked with dfi_error1. */

/***************  Bit definition for DDRDBG_DFI_ERROR_STATUS  **************/
#define DDRDBG_DFI_ERROR_STATUS_DFI_ERROR0_STATUS_Pos  (0U)
#define DDRDBG_DFI_ERROR_STATUS_DFI_ERROR0_STATUS_Msk  (0x1UL << DDRDBG_DFI_ERROR_STATUS_DFI_ERROR0_STATUS_Pos)  /*!< 0x00000001 */
#define DDRDBG_DFI_ERROR_STATUS_DFI_ERROR0_STATUS      DDRDBG_DFI_ERROR_STATUS_DFI_ERROR0_STATUS_Msk            /*!< Gets the status of the interrupt linked with dfi_error0. */
#define DDRDBG_DFI_ERROR_STATUS_DFI_ERROR1_STATUS_Pos  (8U)
#define DDRDBG_DFI_ERROR_STATUS_DFI_ERROR1_STATUS_Msk  (0x1UL << DDRDBG_DFI_ERROR_STATUS_DFI_ERROR1_STATUS_Pos)  /*!< 0x00000100 */
#define DDRDBG_DFI_ERROR_STATUS_DFI_ERROR1_STATUS      DDRDBG_DFI_ERROR_STATUS_DFI_ERROR1_STATUS_Msk            /*!< Gets the status of the interrupt linked with dfi_error1. */

/***************  Bit definition for DDRDBG_DFI_ERROR_MSK  *****************/
#define DDRDBG_DFI_ERROR_MSK_DFI_ERROR0_MASK_Pos  (0U)
#define DDRDBG_DFI_ERROR_MSK_DFI_ERROR0_MASK_Msk  (0x1UL << DDRDBG_DFI_ERROR_MSK_DFI_ERROR0_MASK_Pos)  /*!< 0x00000001 */
#define DDRDBG_DFI_ERROR_MSK_DFI_ERROR0_MASK      DDRDBG_DFI_ERROR_MSK_DFI_ERROR0_MASK_Msk            /*!< Interrupt linked to dfi_error0 is masked. Clears the interrupt linked with dfi_error0. */
#define DDRDBG_DFI_ERROR_MSK_DFI_ERROR1_MASK_Pos  (8U)
#define DDRDBG_DFI_ERROR_MSK_DFI_ERROR1_MASK_Msk  (0x1UL << DDRDBG_DFI_ERROR_MSK_DFI_ERROR1_MASK_Pos)  /*!< 0x00000100 */
#define DDRDBG_DFI_ERROR_MSK_DFI_ERROR1_MASK      DDRDBG_DFI_ERROR_MSK_DFI_ERROR1_MASK_Msk            /*!< Interrupt linked to dfi_error1 is masked. Clears the interrupt linked with dfi_error1. */

/***************  Bit definition for DDRDBG_DDR34_AC_SWIZZLE_ADD3_0  *******/
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD0_Pos  (0U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD0_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD0_Pos)  /*!< 0x0000001F */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD0      DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD0_Msk             /* Remapping input bit on add0 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD1_Pos  (8U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD1_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD1_Pos)  /*!< 0x00001F00 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD1      DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD1_Msk             /* Remapping input bit on add1 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD2_Pos  (16U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD2_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD2_Pos)  /*!< 0x001F0000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD2      DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD2_Msk             /* Remapping input bit on add2 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD3_Pos  (24U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD3_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD3_Pos)  /*!< 0x1F000000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD3      DDRDBG_DDR34_AC_SWIZZLE_ADD3_0_DDR34_AC_SWIZZLING_ADD3_Msk             /* Remapping input bit on add3 DDRPHYC input at the DFI interface. */

/***************  Bit definition for DDRDBG_DDR34_AC_SWIZZLE_ADD7_4  *******/
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD4_Pos  (0U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD4_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD4_Pos)  /*!< 0x0000001F */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD4      DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD4_Msk             /* Remapping input bit on add4 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD5_Pos  (8U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD5_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD5_Pos)  /*!< 0x00001F00 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD5      DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD5_Msk             /* Remapping input bit on add5 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD6_Pos  (16U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD6_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD6_Pos)  /*!< 0x001F0000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD6      DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD6_Msk             /* Remapping input bit on add6 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD7_Pos  (24U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD7_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD7_Pos)  /*!< 0x1F000000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD7      DDRDBG_DDR34_AC_SWIZZLE_ADD7_4_DDR34_AC_SWIZZLING_ADD7_Msk             /* Remapping input bit on add7 DDRPHYC input at the DFI interface. */

/***************  Bit definition for DDRDBG_DDR34_AC_SWIZZLE_ADD11_8  ******/
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD8_Pos   (0U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD8_Msk   (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD8_Pos)   /*!< 0x0000001F */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD8       DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD8_Msk              /* Remapping input bit on add8 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD9_Pos   (8U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD9_Msk   (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD9_Pos)   /*!< 0x00001F00 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD9       DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD9_Msk              /* Remapping input bit on add9 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD10_Pos  (16U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD10_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD10_Pos)  /*!< 0x001F0000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD10      DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD10_Msk             /* Remapping input bit on add10 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD11_Pos  (24U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD11_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD11_Pos)  /*!< 0x1F000000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD11      DDRDBG_DDR34_AC_SWIZZLE_ADD11_8_DDR34_AC_SWIZZLING_ADD11_Msk             /* Remapping input bit on add11 DDRPHYC input at the DFI interface. */

/***************  Bit definition for DDRDBG_DDR34_AC_SWIZZLE_ADD15_12  *****/
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD12_Pos  (0U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD12_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD12_Pos)  /*!< 0x0000001F */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD12      DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD12_Msk             /* Remapping input bit on add12 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD13_Pos  (8U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD13_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD13_Pos)  /*!< 0x00001F00 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD13      DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD13_Msk             /* Remapping input bit on add13 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD14_Pos  (16U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD14_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD14_Pos)  /*!< 0x001F0000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD14      DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD14_Msk             /* Remapping input bit on add14 DDRPHYC input at the DFI interface. */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD15_Pos  (24U)
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD15_Msk  (0x1FUL << DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD15_Pos)  /*!< 0x1F000000 */
#define DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD15      DDRDBG_DDR34_AC_SWIZZLE_ADD15_12_DDR34_AC_SWIZZLING_ADD15_Msk             /* Remapping input bit on add15 DDRPHYC input at the DFI interface. */

