STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213fxx_ca35.h
/*******************  Bits definition for RISC_RCFGLOCKR2 register *************/
#define RISC_RCFGLOCKR2_RLOCK64_Pos    (0U)
#define RISC_RCFGLOCKR2_RLOCK64_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK64_Pos)      /*!< 0x00000001 */
#define RISC_RCFGLOCKR2_RLOCK64        RISC_RCFGLOCKR2_RLOCK64_Msk
#define RISC_RCFGLOCKR2_RLOCK65_Pos    (1U)
#define RISC_RCFGLOCKR2_RLOCK65_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK65_Pos)      /*!< 0x00000002 */
#define RISC_RCFGLOCKR2_RLOCK65        RISC_RCFGLOCKR2_RLOCK65_Msk
#define RISC_RCFGLOCKR2_RLOCK66_Pos    (2U)
#define RISC_RCFGLOCKR2_RLOCK66_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK66_Pos)      /*!< 0x00000004 */
#define RISC_RCFGLOCKR2_RLOCK66        RISC_RCFGLOCKR2_RLOCK66_Msk
#define RISC_RCFGLOCKR2_RLOCK67_Pos    (3U)
#define RISC_RCFGLOCKR2_RLOCK67_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK67_Pos)      /*!< 0x00000008 */
#define RISC_RCFGLOCKR2_RLOCK67        RISC_RCFGLOCKR2_RLOCK67_Msk
#define RISC_RCFGLOCKR2_RLOCK68_Pos    (4U)
#define RISC_RCFGLOCKR2_RLOCK68_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK68_Pos)      /*!< 0x00000010 */
#define RISC_RCFGLOCKR2_RLOCK68        RISC_RCFGLOCKR2_RLOCK68_Msk
#define RISC_RCFGLOCKR2_RLOCK69_Pos    (5U)
#define RISC_RCFGLOCKR2_RLOCK69_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK69_Pos)      /*!< 0x00000020 */
#define RISC_RCFGLOCKR2_RLOCK69        RISC_RCFGLOCKR2_RLOCK69_Msk
#define RISC_RCFGLOCKR2_RLOCK70_Pos    (6U)
#define RISC_RCFGLOCKR2_RLOCK70_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK70_Pos)      /*!< 0x00000040 */
#define RISC_RCFGLOCKR2_RLOCK70        RISC_RCFGLOCKR2_RLOCK70_Msk
#define RISC_RCFGLOCKR2_RLOCK71_Pos    (7U)
#define RISC_RCFGLOCKR2_RLOCK71_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK71_Pos)      /*!< 0x00000080 */
#define RISC_RCFGLOCKR2_RLOCK71        RISC_RCFGLOCKR2_RLOCK71_Msk
#define RISC_RCFGLOCKR2_RLOCK72_Pos    (8U)
#define RISC_RCFGLOCKR2_RLOCK72_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK72_Pos)      /*!< 0x00000100 */
#define RISC_RCFGLOCKR2_RLOCK72        RISC_RCFGLOCKR2_RLOCK72_Msk
#define RISC_RCFGLOCKR2_RLOCK73_Pos    (9U)
#define RISC_RCFGLOCKR2_RLOCK73_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK73_Pos)      /*!< 0x00000200 */
#define RISC_RCFGLOCKR2_RLOCK73        RISC_RCFGLOCKR2_RLOCK73_Msk
#define RISC_RCFGLOCKR2_RLOCK74_Pos    (10U)
#define RISC_RCFGLOCKR2_RLOCK74_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK74_Pos)      /*!< 0x00000400 */
#define RISC_RCFGLOCKR2_RLOCK74        RISC_RCFGLOCKR2_RLOCK74_Msk
#define RISC_RCFGLOCKR2_RLOCK75_Pos    (11U)
#define RISC_RCFGLOCKR2_RLOCK75_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK75_Pos)      /*!< 0x00000800 */
#define RISC_RCFGLOCKR2_RLOCK75        RISC_RCFGLOCKR2_RLOCK75_Msk
#define RISC_RCFGLOCKR2_RLOCK76_Pos    (12U)
#define RISC_RCFGLOCKR2_RLOCK76_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK76_Pos)      /*!< 0x00001000 */
#define RISC_RCFGLOCKR2_RLOCK76        RISC_RCFGLOCKR2_RLOCK76_Msk
#define RISC_RCFGLOCKR2_RLOCK77_Pos    (13U)
#define RISC_RCFGLOCKR2_RLOCK77_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK77_Pos)      /*!< 0x00002000 */
#define RISC_RCFGLOCKR2_RLOCK77        RISC_RCFGLOCKR2_RLOCK77_Msk
#define RISC_RCFGLOCKR2_RLOCK78_Pos    (14U)
#define RISC_RCFGLOCKR2_RLOCK78_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK78_Pos)      /*!< 0x00004000 */
#define RISC_RCFGLOCKR2_RLOCK78        RISC_RCFGLOCKR2_RLOCK78_Msk
#define RISC_RCFGLOCKR2_RLOCK79_Pos    (15U)
#define RISC_RCFGLOCKR2_RLOCK79_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK79_Pos)      /*!< 0x00008000 */
#define RISC_RCFGLOCKR2_RLOCK79        RISC_RCFGLOCKR2_RLOCK79_Msk
#define RISC_RCFGLOCKR2_RLOCK80_Pos    (16U)
#define RISC_RCFGLOCKR2_RLOCK80_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK80_Pos)      /*!< 0x00010000 */
#define RISC_RCFGLOCKR2_RLOCK80        RISC_RCFGLOCKR2_RLOCK80_Msk
#define RISC_RCFGLOCKR2_RLOCK81_Pos    (17U)
#define RISC_RCFGLOCKR2_RLOCK81_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK81_Pos)      /*!< 0x00020000 */
#define RISC_RCFGLOCKR2_RLOCK81        RISC_RCFGLOCKR2_RLOCK81_Msk
#define RISC_RCFGLOCKR2_RLOCK82_Pos    (18U)
#define RISC_RCFGLOCKR2_RLOCK82_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK82_Pos)      /*!< 0x00040000 */
#define RISC_RCFGLOCKR2_RLOCK82        RISC_RCFGLOCKR2_RLOCK82_Msk
#define RISC_RCFGLOCKR2_RLOCK83_Pos    (19U)
#define RISC_RCFGLOCKR2_RLOCK83_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK83_Pos)      /*!< 0x00080000 */
#define RISC_RCFGLOCKR2_RLOCK83        RISC_RCFGLOCKR2_RLOCK83_Msk
#define RISC_RCFGLOCKR2_RLOCK84_Pos    (20U)
#define RISC_RCFGLOCKR2_RLOCK84_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK84_Pos)      /*!< 0x00100000 */
#define RISC_RCFGLOCKR2_RLOCK84        RISC_RCFGLOCKR2_RLOCK84_Msk
#define RISC_RCFGLOCKR2_RLOCK85_Pos    (21U)
#define RISC_RCFGLOCKR2_RLOCK85_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK85_Pos)      /*!< 0x00200000 */
#define RISC_RCFGLOCKR2_RLOCK85        RISC_RCFGLOCKR2_RLOCK85_Msk
#define RISC_RCFGLOCKR2_RLOCK86_Pos    (22U)
#define RISC_RCFGLOCKR2_RLOCK86_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK86_Pos)      /*!< 0x00400000 */
#define RISC_RCFGLOCKR2_RLOCK86        RISC_RCFGLOCKR2_RLOCK86_Msk
#define RISC_RCFGLOCKR2_RLOCK87_Pos    (23U)
#define RISC_RCFGLOCKR2_RLOCK87_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK87_Pos)      /*!< 0x00800000 */
#define RISC_RCFGLOCKR2_RLOCK87        RISC_RCFGLOCKR2_RLOCK87_Msk
#define RISC_RCFGLOCKR2_RLOCK88_Pos    (24U)
#define RISC_RCFGLOCKR2_RLOCK88_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK88_Pos)      /*!< 0x01000000 */
#define RISC_RCFGLOCKR2_RLOCK88        RISC_RCFGLOCKR2_RLOCK88_Msk
#define RISC_RCFGLOCKR2_RLOCK89_Pos    (25U)
#define RISC_RCFGLOCKR2_RLOCK89_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK89_Pos)      /*!< 0x02000000 */
#define RISC_RCFGLOCKR2_RLOCK89        RISC_RCFGLOCKR2_RLOCK89_Msk
#define RISC_RCFGLOCKR2_RLOCK90_Pos    (26U)
#define RISC_RCFGLOCKR2_RLOCK90_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK90_Pos)      /*!< 0x04000000 */
#define RISC_RCFGLOCKR2_RLOCK90        RISC_RCFGLOCKR2_RLOCK90_Msk
#define RISC_RCFGLOCKR2_RLOCK91_Pos    (27U)
#define RISC_RCFGLOCKR2_RLOCK91_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK91_Pos)      /*!< 0x08000000 */
#define RISC_RCFGLOCKR2_RLOCK91        RISC_RCFGLOCKR2_RLOCK91_Msk
#define RISC_RCFGLOCKR2_RLOCK92_Pos    (28U)
#define RISC_RCFGLOCKR2_RLOCK92_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK92_Pos)      /*!< 0x10000000 */
#define RISC_RCFGLOCKR2_RLOCK92        RISC_RCFGLOCKR2_RLOCK92_Msk
#define RISC_RCFGLOCKR2_RLOCK93_Pos    (29U)
#define RISC_RCFGLOCKR2_RLOCK93_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK93_Pos)      /*!< 0x20000000 */
#define RISC_RCFGLOCKR2_RLOCK93        RISC_RCFGLOCKR2_RLOCK93_Msk
#define RISC_RCFGLOCKR2_RLOCK94_Pos    (30U)
#define RISC_RCFGLOCKR2_RLOCK94_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK94_Pos)      /*!< 0x40000000 */
#define RISC_RCFGLOCKR2_RLOCK94        RISC_RCFGLOCKR2_RLOCK94_Msk
#define RISC_RCFGLOCKR2_RLOCK95_Pos    (31U)
#define RISC_RCFGLOCKR2_RLOCK95_Msk    (0x1UL << RISC_RCFGLOCKR2_RLOCK95_Pos)      /*!< 0x80000000 */
#define RISC_RCFGLOCKR2_RLOCK95        RISC_RCFGLOCKR2_RLOCK95_Msk

